grevaillot/svd_tools/headers/STM32H753x/mdios.h
#pragma once 

/* --- MDIOS: Management data input/output slave -------------------- */

/** @defgroup mdios_registers Management data input/output slave Register
@{*/

/** MDIOS_CR MDIOS configuration register **/
#define MDIOS_CR			MMIO32(MDIOS_BASE + 0x00)
/** MDIOS_WRFR MDIOS write flag register **/
#define MDIOS_WRFR			MMIO32(MDIOS_BASE + 0x04)
/** MDIOS_CWRFR MDIOS clear write flag register **/
#define MDIOS_CWRFR			MMIO32(MDIOS_BASE + 0x08)
/** MDIOS_RDFR MDIOS read flag register **/
#define MDIOS_RDFR			MMIO32(MDIOS_BASE + 0x0c)
/** MDIOS_CRDFR MDIOS clear read flag register **/
#define MDIOS_CRDFR			MMIO32(MDIOS_BASE + 0x10)
/** MDIOS_SR MDIOS status register **/
#define MDIOS_SR			MMIO32(MDIOS_BASE + 0x14)
/** MDIOS_CLRFR MDIOS clear flag register **/
#define MDIOS_CLRFR			MMIO32(MDIOS_BASE + 0x18)
/** MDIOS_DINR0 MDIOS input data register 0 **/
#define MDIOS_DINR0			MMIO32(MDIOS_BASE + 0x1c)
/** MDIOS_DINR1 MDIOS input data register 1 **/
#define MDIOS_DINR1			MMIO32(MDIOS_BASE + 0x20)
/** MDIOS_DINR2 MDIOS input data register 2 **/
#define MDIOS_DINR2			MMIO32(MDIOS_BASE + 0x24)
/** MDIOS_DINR3 MDIOS input data register 3 **/
#define MDIOS_DINR3			MMIO32(MDIOS_BASE + 0x28)
/** MDIOS_DINR4 MDIOS input data register 4 **/
#define MDIOS_DINR4			MMIO32(MDIOS_BASE + 0x2c)
/** MDIOS_DINR5 MDIOS input data register 5 **/
#define MDIOS_DINR5			MMIO32(MDIOS_BASE + 0x30)
/** MDIOS_DINR6 MDIOS input data register 6 **/
#define MDIOS_DINR6			MMIO32(MDIOS_BASE + 0x34)
/** MDIOS_DINR7 MDIOS input data register 7 **/
#define MDIOS_DINR7			MMIO32(MDIOS_BASE + 0x38)
/** MDIOS_DINR8 MDIOS input data register 8 **/
#define MDIOS_DINR8			MMIO32(MDIOS_BASE + 0x3c)
/** MDIOS_DINR9 MDIOS input data register 9 **/
#define MDIOS_DINR9			MMIO32(MDIOS_BASE + 0x40)
/** MDIOS_DINR10 MDIOS input data register 10 **/
#define MDIOS_DINR10			MMIO32(MDIOS_BASE + 0x44)
/** MDIOS_DINR11 MDIOS input data register 11 **/
#define MDIOS_DINR11			MMIO32(MDIOS_BASE + 0x48)
/** MDIOS_DINR12 MDIOS input data register 12 **/
#define MDIOS_DINR12			MMIO32(MDIOS_BASE + 0x4c)
/** MDIOS_DINR13 MDIOS input data register 13 **/
#define MDIOS_DINR13			MMIO32(MDIOS_BASE + 0x50)
/** MDIOS_DINR14 MDIOS input data register 14 **/
#define MDIOS_DINR14			MMIO32(MDIOS_BASE + 0x54)
/** MDIOS_DINR15 MDIOS input data register 15 **/
#define MDIOS_DINR15			MMIO32(MDIOS_BASE + 0x58)
/** MDIOS_DINR16 MDIOS input data register 16 **/
#define MDIOS_DINR16			MMIO32(MDIOS_BASE + 0x5c)
/** MDIOS_DINR17 MDIOS input data register 17 **/
#define MDIOS_DINR17			MMIO32(MDIOS_BASE + 0x60)
/** MDIOS_DINR18 MDIOS input data register 18 **/
#define MDIOS_DINR18			MMIO32(MDIOS_BASE + 0x64)
/** MDIOS_DINR19 MDIOS input data register 19 **/
#define MDIOS_DINR19			MMIO32(MDIOS_BASE + 0x68)
/** MDIOS_DINR20 MDIOS input data register 20 **/
#define MDIOS_DINR20			MMIO32(MDIOS_BASE + 0x6c)
/** MDIOS_DINR21 MDIOS input data register 21 **/
#define MDIOS_DINR21			MMIO32(MDIOS_BASE + 0x70)
/** MDIOS_DINR22 MDIOS input data register 22 **/
#define MDIOS_DINR22			MMIO32(MDIOS_BASE + 0x74)
/** MDIOS_DINR23 MDIOS input data register 23 **/
#define MDIOS_DINR23			MMIO32(MDIOS_BASE + 0x78)
/** MDIOS_DINR24 MDIOS input data register 24 **/
#define MDIOS_DINR24			MMIO32(MDIOS_BASE + 0x7c)
/** MDIOS_DINR25 MDIOS input data register 25 **/
#define MDIOS_DINR25			MMIO32(MDIOS_BASE + 0x80)
/** MDIOS_DINR26 MDIOS input data register 26 **/
#define MDIOS_DINR26			MMIO32(MDIOS_BASE + 0x84)
/** MDIOS_DINR27 MDIOS input data register 27 **/
#define MDIOS_DINR27			MMIO32(MDIOS_BASE + 0x88)
/** MDIOS_DINR28 MDIOS input data register 28 **/
#define MDIOS_DINR28			MMIO32(MDIOS_BASE + 0x8c)
/** MDIOS_DINR29 MDIOS input data register 29 **/
#define MDIOS_DINR29			MMIO32(MDIOS_BASE + 0x90)
/** MDIOS_DINR30 MDIOS input data register 30 **/
#define MDIOS_DINR30			MMIO32(MDIOS_BASE + 0x94)
/** MDIOS_DINR31 MDIOS input data register 31 **/
#define MDIOS_DINR31			MMIO32(MDIOS_BASE + 0x98)
/** MDIOS_DOUTR0 MDIOS output data register 0 **/
#define MDIOS_DOUTR0			MMIO32(MDIOS_BASE + 0x9c)
/** MDIOS_DOUTR1 MDIOS output data register 1 **/
#define MDIOS_DOUTR1			MMIO32(MDIOS_BASE + 0xa0)
/** MDIOS_DOUTR2 MDIOS output data register 2 **/
#define MDIOS_DOUTR2			MMIO32(MDIOS_BASE + 0xa4)
/** MDIOS_DOUTR3 MDIOS output data register 3 **/
#define MDIOS_DOUTR3			MMIO32(MDIOS_BASE + 0xa8)
/** MDIOS_DOUTR4 MDIOS output data register 4 **/
#define MDIOS_DOUTR4			MMIO32(MDIOS_BASE + 0xac)
/** MDIOS_DOUTR5 MDIOS output data register 5 **/
#define MDIOS_DOUTR5			MMIO32(MDIOS_BASE + 0xb0)
/** MDIOS_DOUTR6 MDIOS output data register 6 **/
#define MDIOS_DOUTR6			MMIO32(MDIOS_BASE + 0xb4)
/** MDIOS_DOUTR7 MDIOS output data register 7 **/
#define MDIOS_DOUTR7			MMIO32(MDIOS_BASE + 0xb8)
/** MDIOS_DOUTR8 MDIOS output data register 8 **/
#define MDIOS_DOUTR8			MMIO32(MDIOS_BASE + 0xbc)
/** MDIOS_DOUTR9 MDIOS output data register 9 **/
#define MDIOS_DOUTR9			MMIO32(MDIOS_BASE + 0xc0)
/** MDIOS_DOUTR10 MDIOS output data register 10 **/
#define MDIOS_DOUTR10			MMIO32(MDIOS_BASE + 0xc4)
/** MDIOS_DOUTR11 MDIOS output data register 11 **/
#define MDIOS_DOUTR11			MMIO32(MDIOS_BASE + 0xc8)
/** MDIOS_DOUTR12 MDIOS output data register 12 **/
#define MDIOS_DOUTR12			MMIO32(MDIOS_BASE + 0xcc)
/** MDIOS_DOUTR13 MDIOS output data register 13 **/
#define MDIOS_DOUTR13			MMIO32(MDIOS_BASE + 0xd0)
/** MDIOS_DOUTR14 MDIOS output data register 14 **/
#define MDIOS_DOUTR14			MMIO32(MDIOS_BASE + 0xd4)
/** MDIOS_DOUTR15 MDIOS output data register 15 **/
#define MDIOS_DOUTR15			MMIO32(MDIOS_BASE + 0xd8)
/** MDIOS_DOUTR16 MDIOS output data register 16 **/
#define MDIOS_DOUTR16			MMIO32(MDIOS_BASE + 0xdc)
/** MDIOS_DOUTR17 MDIOS output data register 17 **/
#define MDIOS_DOUTR17			MMIO32(MDIOS_BASE + 0xe0)
/** MDIOS_DOUTR18 MDIOS output data register 18 **/
#define MDIOS_DOUTR18			MMIO32(MDIOS_BASE + 0xe4)
/** MDIOS_DOUTR19 MDIOS output data register 19 **/
#define MDIOS_DOUTR19			MMIO32(MDIOS_BASE + 0xe8)
/** MDIOS_DOUTR20 MDIOS output data register 20 **/
#define MDIOS_DOUTR20			MMIO32(MDIOS_BASE + 0xec)
/** MDIOS_DOUTR21 MDIOS output data register 21 **/
#define MDIOS_DOUTR21			MMIO32(MDIOS_BASE + 0xf0)
/** MDIOS_DOUTR22 MDIOS output data register 22 **/
#define MDIOS_DOUTR22			MMIO32(MDIOS_BASE + 0xf4)
/** MDIOS_DOUTR23 MDIOS output data register 23 **/
#define MDIOS_DOUTR23			MMIO32(MDIOS_BASE + 0xf8)
/** MDIOS_DOUTR24 MDIOS output data register 24 **/
#define MDIOS_DOUTR24			MMIO32(MDIOS_BASE + 0xfc)
/** MDIOS_DOUTR25 MDIOS output data register 25 **/
#define MDIOS_DOUTR25			MMIO32(MDIOS_BASE + 0x100)
/** MDIOS_DOUTR26 MDIOS output data register 26 **/
#define MDIOS_DOUTR26			MMIO32(MDIOS_BASE + 0x104)
/** MDIOS_DOUTR27 MDIOS output data register 27 **/
#define MDIOS_DOUTR27			MMIO32(MDIOS_BASE + 0x108)
/** MDIOS_DOUTR28 MDIOS output data register 28 **/
#define MDIOS_DOUTR28			MMIO32(MDIOS_BASE + 0x10c)
/** MDIOS_DOUTR29 MDIOS output data register 29 **/
#define MDIOS_DOUTR29			MMIO32(MDIOS_BASE + 0x110)
/** MDIOS_DOUTR30 MDIOS output data register 30 **/
#define MDIOS_DOUTR30			MMIO32(MDIOS_BASE + 0x114)
/** MDIOS_DOUTR31 MDIOS output data register 31 **/
#define MDIOS_DOUTR31			MMIO32(MDIOS_BASE + 0x118)

/**@}*/


