grevaillot/svd_tools/headers/STM32H753x/mdios.h
/** @defgroup mdios_dinr17 DINR17 MDIOS input data register 17
@{*/


#define MDIOS_DINR17_DIN17_SHIFT		0
#define MDIOS_DINR17_DIN17_MASK		0xffff
/** @defgroup mdios_dinr17_din17 DIN17 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr18 DINR18 MDIOS input data register 18
@{*/


#define MDIOS_DINR18_DIN18_SHIFT		0
#define MDIOS_DINR18_DIN18_MASK		0xffff
/** @defgroup mdios_dinr18_din18 DIN18 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr19 DINR19 MDIOS input data register 19
@{*/


#define MDIOS_DINR19_DIN19_SHIFT		0
#define MDIOS_DINR19_DIN19_MASK		0xffff
/** @defgroup mdios_dinr19_din19 DIN19 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr20 DINR20 MDIOS input data register 20
@{*/


#define MDIOS_DINR20_DIN20_SHIFT		0
#define MDIOS_DINR20_DIN20_MASK		0xffff
/** @defgroup mdios_dinr20_din20 DIN20 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr21 DINR21 MDIOS input data register 21
@{*/


#define MDIOS_DINR21_DIN21_SHIFT		0
#define MDIOS_DINR21_DIN21_MASK		0xffff
/** @defgroup mdios_dinr21_din21 DIN21 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr22 DINR22 MDIOS input data register 22
@{*/


#define MDIOS_DINR22_DIN22_SHIFT		0
#define MDIOS_DINR22_DIN22_MASK		0xffff
/** @defgroup mdios_dinr22_din22 DIN22 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr23 DINR23 MDIOS input data register 23
@{*/


#define MDIOS_DINR23_DIN23_SHIFT		0
#define MDIOS_DINR23_DIN23_MASK		0xffff
/** @defgroup mdios_dinr23_din23 DIN23 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr24 DINR24 MDIOS input data register 24
@{*/


#define MDIOS_DINR24_DIN24_SHIFT		0
#define MDIOS_DINR24_DIN24_MASK		0xffff
/** @defgroup mdios_dinr24_din24 DIN24 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr25 DINR25 MDIOS input data register 25
@{*/


#define MDIOS_DINR25_DIN25_SHIFT		0
#define MDIOS_DINR25_DIN25_MASK		0xffff
/** @defgroup mdios_dinr25_din25 DIN25 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr26 DINR26 MDIOS input data register 26
@{*/


#define MDIOS_DINR26_DIN26_SHIFT		0
#define MDIOS_DINR26_DIN26_MASK		0xffff
/** @defgroup mdios_dinr26_din26 DIN26 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr27 DINR27 MDIOS input data register 27
@{*/


#define MDIOS_DINR27_DIN27_SHIFT		0
#define MDIOS_DINR27_DIN27_MASK		0xffff
/** @defgroup mdios_dinr27_din27 DIN27 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr28 DINR28 MDIOS input data register 28
@{*/


#define MDIOS_DINR28_DIN28_SHIFT		0
#define MDIOS_DINR28_DIN28_MASK		0xffff
/** @defgroup mdios_dinr28_din28 DIN28 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr29 DINR29 MDIOS input data register 29
@{*/


#define MDIOS_DINR29_DIN29_SHIFT		0
#define MDIOS_DINR29_DIN29_MASK		0xffff
/** @defgroup mdios_dinr29_din29 DIN29 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr30 DINR30 MDIOS input data register 30
@{*/


#define MDIOS_DINR30_DIN30_SHIFT		0
#define MDIOS_DINR30_DIN30_MASK		0xffff
/** @defgroup mdios_dinr30_din30 DIN30 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_dinr31 DINR31 MDIOS input data register 31
@{*/


#define MDIOS_DINR31_DIN31_SHIFT		0
#define MDIOS_DINR31_DIN31_MASK		0xffff
/** @defgroup mdios_dinr31_din31 DIN31 Input data received from MDIO Master during write frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr0 DOUTR0 MDIOS output data register 0
@{*/


#define MDIOS_DOUTR0_DOUT0_SHIFT		0
#define MDIOS_DOUTR0_DOUT0_MASK		0xffff
/** @defgroup mdios_doutr0_dout0 DOUT0 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr1 DOUTR1 MDIOS output data register 1
@{*/


#define MDIOS_DOUTR1_DOUT1_SHIFT		0
#define MDIOS_DOUTR1_DOUT1_MASK		0xffff
/** @defgroup mdios_doutr1_dout1 DOUT1 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr2 DOUTR2 MDIOS output data register 2
@{*/


#define MDIOS_DOUTR2_DOUT2_SHIFT		0
#define MDIOS_DOUTR2_DOUT2_MASK		0xffff
/** @defgroup mdios_doutr2_dout2 DOUT2 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr3 DOUTR3 MDIOS output data register 3
@{*/


#define MDIOS_DOUTR3_DOUT3_SHIFT		0
#define MDIOS_DOUTR3_DOUT3_MASK		0xffff
/** @defgroup mdios_doutr3_dout3 DOUT3 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr4 DOUTR4 MDIOS output data register 4
@{*/


#define MDIOS_DOUTR4_DOUT4_SHIFT		0
#define MDIOS_DOUTR4_DOUT4_MASK		0xffff
/** @defgroup mdios_doutr4_dout4 DOUT4 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr5 DOUTR5 MDIOS output data register 5
@{*/


#define MDIOS_DOUTR5_DOUT5_SHIFT		0
#define MDIOS_DOUTR5_DOUT5_MASK		0xffff
/** @defgroup mdios_doutr5_dout5 DOUT5 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr6 DOUTR6 MDIOS output data register 6
@{*/


#define MDIOS_DOUTR6_DOUT6_SHIFT		0
#define MDIOS_DOUTR6_DOUT6_MASK		0xffff
/** @defgroup mdios_doutr6_dout6 DOUT6 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr7 DOUTR7 MDIOS output data register 7
@{*/


#define MDIOS_DOUTR7_DOUT7_SHIFT		0
#define MDIOS_DOUTR7_DOUT7_MASK		0xffff
/** @defgroup mdios_doutr7_dout7 DOUT7 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr8 DOUTR8 MDIOS output data register 8
@{*/


#define MDIOS_DOUTR8_DOUT8_SHIFT		0
#define MDIOS_DOUTR8_DOUT8_MASK		0xffff
/** @defgroup mdios_doutr8_dout8 DOUT8 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

