grevaillot/svd_tools/headers/STM32H753x/mdios.h
/** @defgroup mdios_doutr9 DOUTR9 MDIOS output data register 9
@{*/


#define MDIOS_DOUTR9_DOUT9_SHIFT		0
#define MDIOS_DOUTR9_DOUT9_MASK		0xffff
/** @defgroup mdios_doutr9_dout9 DOUT9 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr10 DOUTR10 MDIOS output data register 10
@{*/


#define MDIOS_DOUTR10_DOUT10_SHIFT		0
#define MDIOS_DOUTR10_DOUT10_MASK		0xffff
/** @defgroup mdios_doutr10_dout10 DOUT10 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr11 DOUTR11 MDIOS output data register 11
@{*/


#define MDIOS_DOUTR11_DOUT11_SHIFT		0
#define MDIOS_DOUTR11_DOUT11_MASK		0xffff
/** @defgroup mdios_doutr11_dout11 DOUT11 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr12 DOUTR12 MDIOS output data register 12
@{*/


#define MDIOS_DOUTR12_DOUT12_SHIFT		0
#define MDIOS_DOUTR12_DOUT12_MASK		0xffff
/** @defgroup mdios_doutr12_dout12 DOUT12 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr13 DOUTR13 MDIOS output data register 13
@{*/


#define MDIOS_DOUTR13_DOUT13_SHIFT		0
#define MDIOS_DOUTR13_DOUT13_MASK		0xffff
/** @defgroup mdios_doutr13_dout13 DOUT13 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr14 DOUTR14 MDIOS output data register 14
@{*/


#define MDIOS_DOUTR14_DOUT14_SHIFT		0
#define MDIOS_DOUTR14_DOUT14_MASK		0xffff
/** @defgroup mdios_doutr14_dout14 DOUT14 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr15 DOUTR15 MDIOS output data register 15
@{*/


#define MDIOS_DOUTR15_DOUT15_SHIFT		0
#define MDIOS_DOUTR15_DOUT15_MASK		0xffff
/** @defgroup mdios_doutr15_dout15 DOUT15 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr16 DOUTR16 MDIOS output data register 16
@{*/


#define MDIOS_DOUTR16_DOUT16_SHIFT		0
#define MDIOS_DOUTR16_DOUT16_MASK		0xffff
/** @defgroup mdios_doutr16_dout16 DOUT16 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr17 DOUTR17 MDIOS output data register 17
@{*/


#define MDIOS_DOUTR17_DOUT17_SHIFT		0
#define MDIOS_DOUTR17_DOUT17_MASK		0xffff
/** @defgroup mdios_doutr17_dout17 DOUT17 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr18 DOUTR18 MDIOS output data register 18
@{*/


#define MDIOS_DOUTR18_DOUT18_SHIFT		0
#define MDIOS_DOUTR18_DOUT18_MASK		0xffff
/** @defgroup mdios_doutr18_dout18 DOUT18 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr19 DOUTR19 MDIOS output data register 19
@{*/


#define MDIOS_DOUTR19_DOUT19_SHIFT		0
#define MDIOS_DOUTR19_DOUT19_MASK		0xffff
/** @defgroup mdios_doutr19_dout19 DOUT19 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr20 DOUTR20 MDIOS output data register 20
@{*/


#define MDIOS_DOUTR20_DOUT20_SHIFT		0
#define MDIOS_DOUTR20_DOUT20_MASK		0xffff
/** @defgroup mdios_doutr20_dout20 DOUT20 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr21 DOUTR21 MDIOS output data register 21
@{*/


#define MDIOS_DOUTR21_DOUT21_SHIFT		0
#define MDIOS_DOUTR21_DOUT21_MASK		0xffff
/** @defgroup mdios_doutr21_dout21 DOUT21 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr22 DOUTR22 MDIOS output data register 22
@{*/


#define MDIOS_DOUTR22_DOUT22_SHIFT		0
#define MDIOS_DOUTR22_DOUT22_MASK		0xffff
/** @defgroup mdios_doutr22_dout22 DOUT22 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr23 DOUTR23 MDIOS output data register 23
@{*/


#define MDIOS_DOUTR23_DOUT23_SHIFT		0
#define MDIOS_DOUTR23_DOUT23_MASK		0xffff
/** @defgroup mdios_doutr23_dout23 DOUT23 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr24 DOUTR24 MDIOS output data register 24
@{*/


#define MDIOS_DOUTR24_DOUT24_SHIFT		0
#define MDIOS_DOUTR24_DOUT24_MASK		0xffff
/** @defgroup mdios_doutr24_dout24 DOUT24 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr25 DOUTR25 MDIOS output data register 25
@{*/


#define MDIOS_DOUTR25_DOUT25_SHIFT		0
#define MDIOS_DOUTR25_DOUT25_MASK		0xffff
/** @defgroup mdios_doutr25_dout25 DOUT25 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr26 DOUTR26 MDIOS output data register 26
@{*/


#define MDIOS_DOUTR26_DOUT26_SHIFT		0
#define MDIOS_DOUTR26_DOUT26_MASK		0xffff
/** @defgroup mdios_doutr26_dout26 DOUT26 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr27 DOUTR27 MDIOS output data register 27
@{*/


#define MDIOS_DOUTR27_DOUT27_SHIFT		0
#define MDIOS_DOUTR27_DOUT27_MASK		0xffff
/** @defgroup mdios_doutr27_dout27 DOUT27 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr28 DOUTR28 MDIOS output data register 28
@{*/


#define MDIOS_DOUTR28_DOUT28_SHIFT		0
#define MDIOS_DOUTR28_DOUT28_MASK		0xffff
/** @defgroup mdios_doutr28_dout28 DOUT28 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr29 DOUTR29 MDIOS output data register 29
@{*/


#define MDIOS_DOUTR29_DOUT29_SHIFT		0
#define MDIOS_DOUTR29_DOUT29_MASK		0xffff
/** @defgroup mdios_doutr29_dout29 DOUT29 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr30 DOUTR30 MDIOS output data register 30
@{*/


#define MDIOS_DOUTR30_DOUT30_SHIFT		0
#define MDIOS_DOUTR30_DOUT30_MASK		0xffff
/** @defgroup mdios_doutr30_dout30 DOUT30 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/

/** @defgroup mdios_doutr31 DOUTR31 MDIOS output data register 31
@{*/


#define MDIOS_DOUTR31_DOUT31_SHIFT		0
#define MDIOS_DOUTR31_DOUT31_MASK		0xffff
/** @defgroup mdios_doutr31_dout31 DOUT31 Output data sent to MDIO Master during read frames
@{*/
/**@}*/


/**@}*/
